УправлениеРассылками/src/Documents/Рассылка/Рассылка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рассылка</name>
  <basedOn>Document.ЗаявкаНаРассылку</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРассылку</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>CatalogRef.СегментыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчётныеЗаписиЭП</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеРассылками/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
</mdclass:Enum>

УправлениеРассылками/src/Documents/Рассылка/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРассылку") Тогда
		Если НЕ ДанныеЗаполнения.Статус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Неверный статус заявки";
			//Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			//TODO: отменить создание рассылки при таких статусах заявок
		КонецЕсли;
		// Заполнение шапки
		ТемаПисьма = ДанныеЗаполнения.Наименование;
		Заявка = ДанныеЗаполнения.Ссылка;

	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (не Заявка.Статус = Перечисления.СтатусыЗаявок.ВРаботе) тогда
		Сообщить("Невозможно создать или изменить рассылку по несогласованной или завершенной заявке");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
